
define (function(){
    var ERROR =
	{
	    // stock
	    2001: "货品资料已存在！！",
	    2018: "该货品资料不存在，请重建货品资料后再进行操作！！", 
	    2098: "该货品资料正在使用，请先删除该货品对应的库存！！",
	    2099: "修改前后数据一致，请重新编辑修改项！！",
	    1601: "厂商创建失败，已存在同样的厂商！！",
	    1901: "该颜色已存在，请重新输入颜色名！！",
	    1902: "该尺码组已存在！！", 

	    // retailer
	    2101: "会员信息重复，该手机号码已注册！！",
	    2102: "会员密码不正确，请重新输入！！",
	    2103: "充值方案名称已存在，请重新输入方案名称!!",
	    2104: "积分方案已存在，请重新输入方案，！！",
	    2105: "该电子卷不存在，请重新选择电子卷！！",
	    2106: "该电子卷已经确认过，无法再确认，请重新选择电子卷！！",
	    2107: "该电子卷已被消费，请重新选择电子卷",
	    2108: "积分况换钱的方案有且只能有一个！！",
	    2109: "非法充值方案标识，请重新选择充值方案！！",
	    2501: "短信中心不存在，请联系服务人员！！",
	    2502: "短信发送失败，余额不足，请联系服务人员充值！！",
	    2503: "短信提醒服务没有开通，请联系服务人员开通该功能！！",
	    2599: "短信发送失败，请核对号码后人工重新发送！！",
	    2110: "该充值方案正在使用，请解挂该充值方案后再删除！！",
	    
	    9001: "数据库操作失败，请联系服务人员！！"
	};

    return ERROR;
});


